Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# MenuTip.SplitVerticallywithCurrentProfile
source: Splits the current session vertically, placing a new session in the right half. The new session inherits the profile of the current session, including any changes made in `Session > Edit Session`.
de: Teilt die aktuelle Sitzung vertikal, wobei eine neue Sitzung in der rechten Hälfte platziert wird. Die neue Sitzung übernimmt das Profil der aktuellen Sitzung, einschließlich aller Änderungen, die unter `Session > Edit Session` vorgenommen wurden.
ja: 現在のセッションを垂直に分割し、新しいセッションを右半分に配置します。新しいセッションは、`セッション > セッションを編集`で行った変更を含め、現在のセッションのプロファイルを引き継ぎます。
pt_br: Divide a sessão atual verticalmente, colocando uma nova sessão na metade direita. A nova sessão herda o perfil da sessão atual, incluindo quaisquer alterações feitas em `Sessão > Editar sessão`.
ru: Разделяет текущую сессию по вертикали, помещая новую сессию в правую половину. Новая сессия наследует профиль текущей сессии, включая любые изменения, внесённые в `Session > Edit Session`.
zh_hans: 垂直分割当前会话，将新会话放在右侧半部分。新会话会继承当前会话的配置文件，包括 `Session > Edit Session`中的任何更改。

# MenuTip.StartInstantReplay
source: **Instant Replay** lets you review recent terminal history. It’s handy if something just disappeared from the screen and it isn’t in scrollback history.
de: **Sofortwiedergabe** ermöglicht es Ihnen, die letzte Terminal-Historie noch einmal anzusehen. Praktisch, wenn gerade etwas vom Bildschirm verschwunden ist und es sich nicht im Scrollback-Verlauf befindet.
ja: **インスタントリプレイ**を使うと、最近のターミナル履歴を振り返ることができます。画面から消えてしまい、スクロールバック履歴にも残っていない内容を確認したいときに便利です。
pt_br: O **Instant Replay** permite revisar o histórico recente do terminal. É útil se algo acabou de desaparecer da tela e não está no histórico de rolagem.
ru: **Мгновенный повтор** позволяет просмотреть недавнюю историю терминала. Это удобно, если что-то только что исчезло с экрана и этого нет в истории прокрутки.
zh_hans: **即时回放**功能可让你查看最近的终端历史记录。如果某内容从屏幕上消失且不在滚动回放记录中，这个功能非常实用。

# MenuTip.StopCoprocess
source: Stops the active coprocess. Input to the terminal is no longer redirected to the coprocess, and its output ceases.
de: Beendet den aktiven Koprozess. Eingaben an das Terminal werden nicht mehr an den Koprozess umgeleitet, und seine Ausgabe endet.
ja: 実行中のコプロセスを停止します。ターミナルへの入力はコプロセスへリダイレクトされなくなり、その出力も止まります。
pt_br: Interrompe o coprocesso ativo. A entrada do terminal deixa de ser redirecionada para o coprocesso, e sua saída cessa.
ru: Останавливает активный сопроцесс. Ввод в терминал больше не перенаправляется сопроцессу, а его вывод прекращается.
zh_hans: 会停止当前协处理器的运行。对终端的输入将不再被重定向到该协处理器，其输出也会停止。

# MenuTip.TerminalState.LiteralMode
source: When enabled, control characters are displayed visually rather than being interpreted as usual.
de: Wenn aktiviert, werden Steuerzeichen visuell dargestellt, anstatt wie gewohnt interpretiert zu werden.
ja: 有効にすると、制御文字は通常のように解釈されるのではなく、視覚的に表示されます。
pt_br: Quando ativado, os caracteres de controle são exibidos visualmente em vez de serem interpretados como de costume.
ru: Когда включено, управляющие символы отображаются визуально, а не интерпретируются как обычно.
zh_hans: 启用后，控制字符会以可视化形式显示，而非按常规方式解释。

# MenuTip.TerminalState.ReportModifierswithCSIu
source: This mode is generally not recommended. **Disambiguate Escape** is a more modern approach.
de: Dieser Modus wird im Allgemeinen nicht empfohlen. **Escape eindeutig machen** ist ein moderneres Vorgehen.
ja: このモードは一般的には推奨されません。**エスケープの曖昧さ回避**の方がより現代的な方法です。
pt_br: Este modo geralmente não é recomendado. **Disambiguate Escape** é uma abordagem mais moderna.
ru: Этот режим, как правило, не рекомендуется. **Устранение неоднозначности Escape** является более современным подходом.
zh_hans: 通常不建议使用此模式。**消歧义退出键**是一种更现代的实现方式。

# MenuTip.tmux.Dashboard
source: The **tmux Dashboard** helps you switch between tmux sessions, show and hide windows, and administer other features of tmux without needing to use tmux’s commands.
de: Das **tmux-Dashboard** hilft Ihnen, zwischen tmux-Sitzungen zu wechseln, Fenster ein- und auszublenden und andere Funktionen von tmux zu verwalten, ohne die Befehle von tmux verwenden zu müssen.
ja: **tmuxダッシュボード**を使うと、tmuxのコマンドを使わずに、tmuxセッションの切り替え、ウィンドウの表示・非表示、その他のtmux機能の管理を行えます。
pt_br: O **tmux Dashboard** ajuda você a alternar entre sessões tmux, mostrar e ocultar janelas e administrar outros recursos do tmux sem precisar usar os comandos do tmux.
ru: **Панель управления tmux** помогает переключаться между сессиями tmux, показывать и скрывать окна, а также управлять другими функциями tmux без необходимости использовать команды tmux.
zh_hans: **tmux仪表板**帮助你在tmux会话之间切换、显示和隐藏窗格，以及管理tmux的其他功能，而无需使用tmux的命令。

# MenuTip.ToggleBufferInput
source: While Buffer Input is turned on, keyboard input is stored in a buffer. It will be sent when Buffer Input is turned off. You can also configure a trigger to change the Buffer Input setting.
de: Solange die Eingabepufferung aktiviert ist, wird die Tastatureingabe in einem Puffer gespeichert. Sie wird gesendet, sobald die Eingabepufferung deaktiviert wird. Sie können auch einen Trigger konfigurieren, der die Einstellung für die Eingabepufferung ändert.
ja: バッファ入力がオンの間、キーボード入力はバッファに保存されます。バッファ入力をオフにすると送信されます。トリガーを設定してバッファ入力の設定を変更することもできます。
pt_br: Enquanto o Buffer Input está ativado, a entrada do teclado é armazenada em um buffer. Ela será enviada quando o Buffer Input for desativado. Você também pode configurar um gatilho para alterar o ajuste de Buffer Input.
ru: Пока включена буферизация ввода, ввод с клавиатуры сохраняется в буфере. Он будет отправлен, когда буферизация ввода будет отключена. Вы также можете настроить триггер для изменения настройки буферизации ввода.
zh_hans: 当“缓冲区输入”开启时，键盘输入会存储在缓冲区中。当该设置关闭后，这些内容将被发送。您也可以配置触发器来更改“缓冲区输入”的设置。

# MenuTip.ToggleDebugLogging
source: Debug logs are saved in memory while this setting is enabled and written to `/tmp/debuglog.txt` when you turn it off. Memory use is capped at about 200MB; if the log grows past that, the oldest entries are discarded so the most recent activity is always kept.
de: Debug-Protokolle werden im Speicher abgelegt, solange diese Einstellung aktiviert ist, und beim Deaktivieren nach `/tmp/debuglog.txt` geschrieben. Der Speicherverbrauch ist auf etwa 200 MB begrenzt; wächst das Protokoll darüber hinaus, werden die ältesten Einträge verworfen, sodass die neueste Aktivität stets erhalten bleibt.
ja: この設定が有効な間、デバッグログはメモリに保存され、オフにすると`/tmp/debuglog.txt`に書き出されます。メモリ使用量は約200MBに制限されており、ログがそれを超えて増加すると、最も古いエントリが破棄され、常に最新の活動が保持されます。
pt_br: Os logs de depuração são salvos na memória enquanto este ajuste está ativado e gravados em `/tmp/debuglog.txt` quando você o desativa. O uso de memória é limitado a cerca de 200MB; se o log crescer além disso, as entradas mais antigas são descartadas para que a atividade mais recente seja sempre mantida.
ru: Пока эта настройка включена, отладочные журналы сохраняются в памяти, а при её отключении записываются в `/tmp/debuglog.txt`. Использование памяти ограничено примерно 200 МБ; если журнал превышает этот размер, самые старые записи удаляются, чтобы всегда сохранялась самая последняя активность.
zh_hans: 当此设置启用时，调试日志会保存在内存中，并在关闭时写入 `/tmp/debuglog.txt` 文件中。内存使用量被限制在约200MB；如果日志超过此限制，最旧的记录会被丢弃，从而确保最新的活动始终被保留。

# MenuTip.Toolbelt
source: The **Toolbelt** provides a versatile, dockable sidebar that offers quick access to frequently used features and information. It supports multiple panels that can be displayed simultaneously, including clipboard history, recently opened directories, command history, a scratchpad for notes, and more.
de: Der **Werkzeuggürtel** bietet eine vielseitige, andockbare Seitenleiste mit schnellem Zugriff auf häufig verwendete Funktionen und Informationen. Er unterstützt mehrere Bereiche, die gleichzeitig angezeigt werden können, darunter Zwischenablage-Verlauf, zuletzt geöffnete Verzeichnisse, Befehlsverlauf, ein Notizblock für Notizen und mehr.
ja: **ツールベルト**は、よく使う機能や情報にすばやくアクセスできる、多機能でドッキング可能なサイドバーです。クリップボード履歴、最近開いたディレクトリ、コマンド履歴、メモ用のスクラッチパッドなど、複数のパネルを同時に表示できます。
pt_br: A **Caixa de ferramentas** oferece uma barra lateral versátil e encaixável que dá acesso rápido a recursos e informações usados com frequência. Ela suporta vários painéis que podem ser exibidos simultaneamente, incluindo histórico da área de transferência, diretórios abertos recentemente, histórico de comandos, um bloco de rascunho para notas e muito mais.
ru: **Панель инструментов** предоставляет универсальную закрепляемую боковую панель, обеспечивающую быстрый доступ к часто используемым функциям и информации. Она поддерживает несколько панелей, которые можно отображать одновременно, включая историю буфера обмена, недавно открытые каталоги, историю команд, блокнот для заметок и многое другое.
zh_hans: **Toolbelt** 提供了一个多功能可停靠的侧边栏，可以快速访问常用功能和信息。它支持多个可以同时显示的窗格，包括剪贴板历史记录、最近打开的目录、命令历史、便签等。

# MenuTip.Toolbelt.Actions
source: Actions are saved instructions for iTerm2. For example, you could create an action that opens a new window and then creates a split pane.
de: Aktionen sind gespeicherte Anweisungen für iTerm2. Sie könnten zum Beispiel eine Aktion erstellen, die ein neues Fenster öffnet und dann einen geteilten Bereich erstellt.
ja: アクションは、iTerm2に対して保存された指示です。たとえば、新しいウィンドウを開いてから分割ペインを作成するアクションを作ることができます。
pt_br: Ações são instruções salvas para o iTerm2. Por exemplo, você poderia criar uma ação que abre uma nova janela e depois cria um painel dividido.
ru: Действия представляют собой сохранённые инструкции для iTerm2. Например, можно создать действие, которое открывает новое окно, а затем создаёт разделённую панель.
zh_hans: “动作”是 iTerm2 保存的指令。例如，您可以创建一个动作来打开新窗口，然后创建分屏窗格。

# MenuTip.Toolbelt.CapturedOutput
source: **Captured Output** works in conjunction with a Trigger to detect interesting text in the terminal and make it easy to find. The Toolbelt tool shows a list of captured text. You can click to navigate to it or double-click to enter a programmable command. This is useful for finding errors in the output of a build command, for example. It requires Shell Integration.
de: **Erfasste Ausgabe** arbeitet zusammen mit einem Trigger, um interessanten Text im Terminal zu erkennen und leicht auffindbar zu machen. Das Werkzeug im Werkzeuggürtel zeigt eine Liste des erfassten Texts. Sie können klicken, um dorthin zu springen, oder doppelklicken, um einen programmierbaren Befehl einzugeben. Das ist zum Beispiel nützlich, um Fehler in der Ausgabe eines Build-Befehls zu finden. Shell-Integration ist erforderlich.
ja: **キャプチャした出力**はトリガーと連携して、ターミナル内の注目すべきテキストを検出し、見つけやすくします。ツールベルトのツールにキャプチャされたテキストの一覧が表示されます。クリックしてそこへ移動したり、ダブルクリックしてプログラム可能なコマンドを入力したりできます。たとえば、ビルドコマンドの出力からエラーを見つけるのに役立ちます。シェル統合が必要です。
pt_br: A **Saída capturada** funciona em conjunto com um gatilho para detectar texto interessante no terminal e facilitar sua localização. A ferramenta da caixa de ferramentas mostra uma lista de texto capturado. Você pode clicar para navegar até ele ou clicar duas vezes para executar um comando programável. Isto é útil para encontrar erros na saída de um comando de compilação, por exemplo. Requer a Shell Integration.
ru: **Захваченный вывод** работает совместно с триггером, обнаруживая интересный текст в терминале и упрощая его поиск. Инструмент панели инструментов показывает список захваченного текста. Вы можете щёлкнуть, чтобы перейти к нему, или дважды щёлкнуть, чтобы ввести программируемую команду. Это полезно, например, для поиска ошибок в выводе команды сборки. Требуется интеграция с оболочкой.
zh_hans: **捕获输出**与触发器配合工作，可以检测终端中的有趣文本并使其易于查找。Toolbelt 工具会显示捕获文本的列表。您可以点击以导航到该内容，或双击进入可编程命令。这对于查找构建命令输出中的错误非常有用，例如。它需要 Shell 集成功能。

# MenuTip.Toolbelt.Codecierge
source: **Codecierge** uses AI to help you achieve a goal. Tell it what you want to do, and it can watch your terminal to interpret output and suggest commands. Shell Integration is required.
de: **Codecierge** nutzt KI, um Ihnen zu helfen, ein Ziel zu erreichen. Teilen Sie ihm mit, was Sie erreichen möchten, und es kann Ihr Terminal beobachten, um die Ausgabe zu interpretieren und Befehle vorzuschlagen. Shell-Integration ist erforderlich.
ja: **Codecierge**はAIを使ってあなたが目標を達成するのを助けます。やりたいことを伝えると、ターミナルを監視して出力を解釈し、コマンドを提案します。シェル統合が必要です。
pt_br: O **Concierge de código** usa IA para ajudar você a atingir um objetivo. Diga a ele o que você quer fazer, e ele pode observar seu terminal para interpretar a saída e sugerir comandos. É necessária a Shell Integration.
ru: **Codecierge** использует ИИ, чтобы помочь вам достичь цели. Расскажите ему, что вы хотите сделать, и он сможет следить за вашим терминалом, интерпретировать вывод и предлагать команды. Требуется интеграция с оболочкой.
zh_hans: **Codecierge** 利用 AI 帮助您实现目标。告诉它您需要做什么，它可以监控您的终端以解析输出并建议命令。需要 Shell 集成功能。

# MenuTip.Toolbelt.CommandHistory
source: If Shell Integration is installed, **Command History** shows a searchable list of recently run commands on the current host.
de: Wenn Shell-Integration installiert ist, zeigt der **Befehlsverlauf** eine durchsuchbare Liste der zuletzt auf dem aktuellen Host ausgeführten Befehle.
ja: シェル統合がインストールされている場合、**コマンド履歴**は現在のホストで最近実行したコマンドの検索可能な一覧を表示します。
pt_br: Se a Shell Integration estiver instalada, o **Histórico de comandos** mostra uma lista pesquisável de comandos executados recentemente no host atual.
ru: Если установлена интеграция с оболочкой, **История команд** показывает список с возможностью поиска по недавно выполненным командам на текущем узле.
zh_hans: 如果安装了 Shell 集成功能，**命令历史记录**会显示当前主机上最近运行的命令可搜索列表。

# MenuTip.Toolbelt.NamedMarks
source: A **Named Mark** appears as a blue triangle in the left margin. In addition to being easy to navigate with **Next Mark** and **Previous Mark**, you can also find Named Marks in this Toolbelt tool.
de: Eine **Benannte Markierung** erscheint als blaues Dreieck am linken Rand. Sie lässt sich nicht nur einfach mit **Nächste Markierung** und **Vorherige Markierung** ansteuern, sondern Benannte Markierungen finden Sie auch in diesem Werkzeug des Werkzeuggürtels.
ja: **名前付きマーク**は左余白に青い三角形として表示されます。**次のマーク**や**前のマーク**で簡単に移動できるだけでなく、このツールベルトツールでも名前付きマークを確認できます。
pt_br: Uma **marca nomeada** aparece como um triângulo azul na margem esquerda. Além de serem fáceis de navegar com **Próxima marca** e **Marca anterior**, você também pode encontrar as marcas nomeadas nesta ferramenta da caixa de ferramentas.
ru: **Именованная метка** отображается в виде синего треугольника на левом поле. Помимо удобной навигации с помощью **Следующая метка** и **Предыдущая метка**, именованные метки также можно найти в этом инструменте панели инструментов.
zh_hans: **命名标记**以左边缘的蓝色三角形形式出现。除了可以通过 **下一个标记** 和 **上一个标记** 轻松导航外，您还可以在此 Toolbelt 工具中找到命名标记。

# MenuTip.Toolbelt.Notes
source: **Notes** is a single, persistent notepad in your Toolbelt. It’s useful for keeping track of what you’re doing or composing messages.
de: **Notizen** ist ein einzelner, dauerhafter Notizblock in Ihrem Werkzeuggürtel. Praktisch, um im Blick zu behalten, was Sie gerade tun, oder um Nachrichten zu verfassen.
ja: **メモ**は、ツールベルト内にある1つの永続的なメモ帳です。作業内容を記録したり、メッセージを作成したりするのに便利です。
pt_br: **Notas** é um bloco de notas único e persistente na sua caixa de ferramentas. É útil para controlar o que você está fazendo ou compor mensagens.
ru: **Заметки** представляют собой единый, постоянно сохраняемый блокнот на панели инструментов. Это удобно для отслеживания того, чем вы занимаетесь, или для составления сообщений.
zh_hans: **备注**是您 Toolbelt 中的单个持久性记事本。它有助于记录您的操作或撰写消息。

# MenuTip.Toolbelt.PasteHistory
source: **Paste History** shows text that you have copied and pasted in iTerm2. You can configure it to be saved long term.
de: **Einfügeverlauf** zeigt Text, den Sie in iTerm2 kopiert und eingefügt haben. Sie können ihn so konfigurieren, dass er langfristig gespeichert wird.
ja: **ペースト履歴**は、iTerm2でコピー・ペーストしたテキストを表示します。長期間保存されるように設定することもできます。
pt_br: O **Histórico de colagem** mostra o texto que você copiou e colou no iTerm2. Você pode configurá-lo para ser salvo a longo prazo.
ru: **История вставок** показывает текст, который вы копировали и вставляли в iTerm2. Вы можете настроить её для долгосрочного хранения.
zh_hans: **粘贴历史记录**显示您在 iTerm2 中复制并粘贴的文本。您可以配置将其长期保存。

# MenuTip.Toolbelt.Profiles
source: Shows a list of your profiles so you can create new sessions easily.
de: Zeigt eine Liste Ihrer Profile, damit Sie ganz einfach neue Sitzungen erstellen können.
ja: プロファイルの一覧を表示し、新しいセッションを簡単に作成できるようにします。
pt_br: Mostra uma lista dos seus perfis para que você possa criar novas sessões com facilidade.
ru: Показывает список ваших профилей, чтобы вы могли легко создавать новые сессии.
zh_hans: 显示您的配置文件列表，便于轻松创建新会话。

# MenuTip.Toolbelt.RecentDirectories
source: Shows your most used directories, sorted by a combination of frequency and recency of use. Requires Shell Integration.
de: Zeigt Ihre am häufigsten verwendeten Verzeichnisse, sortiert nach einer Kombination aus Häufigkeit und Aktualität der Nutzung. Erfordert Shell-Integration.
ja: 使用頻度と最近使用したかどうかを組み合わせて並べ替えた、よく使うディレクトリを表示します。シェル統合が必要です。
pt_br: Mostra seus diretórios mais usados, ordenados por uma combinação de frequência e recência de uso. Requer a Shell Integration.
ru: Показывает наиболее часто используемые каталоги, отсортированные по сочетанию частоты и недавности использования. Требуется интеграция с оболочкой.
zh_hans: 按使用频率和最近性组合排序，显示您最常用的目录。需要 Shell 集成功能。

# MenuTip.Toolbelt.SessionStatus
source: The **Session Status** tool shows the status of sessions across all tabs. Statuses can be set by the **Set Tab Status** trigger or by programs using a control sequence. Each entry shows the session name, a colored indicator dot, status text, and a keyboard shortcut to jump to that session.
de: Das Werkzeug **Sitzungsstatus** zeigt den Status von Sitzungen über alle Tabs hinweg an. Der Status kann durch den Trigger **Tab-Status setzen** oder durch Programme mithilfe einer Steuersequenz gesetzt werden. Jeder Eintrag zeigt den Sitzungsnamen, einen farbigen Statuspunkt, den Statustext und eine Tastenkombination, um zu dieser Sitzung zu springen.
ja: **セッションステータス**ツールは、すべてのタブにわたるセッションのステータスを表示します。ステータスは**タブステータスを設定**トリガーや、制御シーケンスを使うプログラムによって設定できます。各項目には、セッション名、色付きのインジケータドット、ステータステキスト、そのセッションへジャンプするためのキーボードショートカットが表示されます。
pt_br: A ferramenta **Status da sessão** mostra o status das sessões em todas as abas. Os status podem ser definidos pelo gatilho **Set Tab Status** ou por programas usando uma sequência de controle. Cada entrada mostra o nome da sessão, um ponto indicador colorido, o texto de status e um atalho de teclado para saltar para essa sessão.
ru: Инструмент **Статус сессии** показывает статус сессий во всех вкладках. Статусы можно устанавливать с помощью триггера **Установить статус вкладки** или программами через управляющую последовательность. Каждая запись показывает имя сессии, цветной индикатор, текст статуса и сочетание клавиш для перехода к этой сессии.
zh_hans: **会话状态**工具显示所有标签页的会话状态。可通过**设置标签页状态**触发器或使用控制序列由程序设置状态。每条记录包含会话名称、彩色指示点、状态文本及跳转到该会话的快捷键。

# MenuTip.Toolbelt.Snippets
source: Snippets are pieces of text that you save to reuse later. They’re great for frequently used commands, hard-to-remember directories, and much more.
de: Schnipsel sind Textstücke, die Sie speichern, um sie später wiederzuverwenden. Sie eignen sich hervorragend für häufig verwendete Befehle, schwer zu merkende Verzeichnisse und vieles mehr.
ja: スニペットは、後で再利用するために保存しておくテキストの断片です。よく使うコマンドや覚えにくいディレクトリなど、さまざまな用途に便利です。
pt_br: Fragmentos são pedaços de texto que você salva para reutilizar mais tarde. São ótimos para comandos usados com frequência, diretórios difíceis de lembrar e muito mais.
ru: Сниппеты представляют собой фрагменты текста, которые вы сохраняете для повторного использования. Они отлично подходят для часто используемых команд, труднозапоминаемых каталогов и многого другого.
zh_hans: 片段是您保存的文本块，可供后续复用。适用于常用命令、难以记忆的目录等场景。

# MenuTip.Triggers
source: **Triggers** are actions the terminal performs automatically when text matching a regular expression is received. For example, you can highlight text or display an alert.
de: **Trigger** sind Aktionen, die das Terminal automatisch ausführt, wenn Text empfangen wird, der einem regulären Ausdruck entspricht. Sie können zum Beispiel Text hervorheben oder eine Warnung anzeigen.
ja: **トリガー**は、正規表現に一致するテキストを受信したときにターミナルが自動的に実行するアクションです。たとえば、テキストをハイライトしたり、アラートを表示したりできます。
pt_br: **Gatilhos** são ações que o terminal executa automaticamente quando um texto que corresponde a uma expressão regular é recebido. Por exemplo, você pode destacar texto ou exibir um alerta.
ru: **Триггеры** представляют собой действия, которые терминал выполняет автоматически при получении текста, соответствующего регулярному выражению. Например, вы можете выделить текст или показать оповещение.
zh_hans: **触发器**是终端在收到与正则表达式匹配的文本时自动执行的操作。例如，可以高亮文本或显示警报。

# MenuTip.ZoomInonSelection
source: Hides everything except the lines of selected text to remove distractions.
de: Blendet alles außer den Zeilen des ausgewählten Texts aus, um Ablenkungen zu vermeiden.
ja: 選択したテキストの行以外をすべて隠して、気を散らすものを取り除きます。
pt_br: Oculta tudo, exceto as linhas de texto selecionado, para remover distrações.
ru: Скрывает всё, кроме строк выделенного текста, чтобы убрать отвлекающие элементы.
zh_hans: 隐藏除选中文本行外的所有内容，避免干扰。

# MessageCell.Fork
source: Fork
de: Verzweigen
ja: フォーク
pt_br: Bifurcar
ru: Разветвить
zh_hans: 派生

# MessagePrepPipeline.UploadFailed
source: Failed to upload %1$@: %2$@
de: Hochladen von %1$@ fehlgeschlagen: %2$@
ja: %1$@のアップロードに失敗しました: %2$@
pt_br: Falha ao enviar %1$@: %2$@
ru: Не удалось загрузить %1$@: %2$@
zh_hans: 上传 %1$@ 失败：%2$@

# MessagePrepPipeline.UploadFinishedAttachments
source: Upload of attachments finished.
de: Hochladen der Anhänge abgeschlossen.
ja: 添付ファイルのアップロードが完了しました。
pt_br: Envio dos anexos concluído.
ru: Загрузка вложений завершена.
zh_hans: 附件上传完成。

# MessagePrepPipeline.UploadFinishedFile
source: Upload of %@ finished.
de: Hochladen von %@ abgeschlossen.
ja: %@のアップロードが完了しました。
pt_br: Envio de %@ concluído.
ru: Загрузка %@ завершена.
zh_hans: %@ 上传完成。

# MessagePrepPipeline.Uploading
source: Uploading…
de: Wird hochgeladen…
ja: アップロード中…
pt_br: Enviando…
ru: Загрузка…
zh_hans: 正在上传…

# MessagePrepPipeline.VectorStoreAddFailed
source: There was a problem adding files to the vector store: %@
de: Beim Hinzufügen von Dateien zum Vektorspeicher ist ein Problem aufgetreten: %@
ja: ベクトルストアへのファイルの追加中に問題が発生しました: %@
pt_br: Ocorreu um problema ao adicionar arquivos ao vector store: %@
ru: Возникла проблема при добавлении файлов в векторное хранилище: %@
zh_hans: 向向量存储添加文件时出现问题：%@

# MessagePrepPipeline.VectorStoreCreateFailed
source: There was a problem creating a vector store database: %@
de: Beim Erstellen einer Vektorspeicher-Datenbank ist ein Problem aufgetreten: %@
ja: ベクトルストアデータベースの作成中に問題が発生しました: %@
pt_br: Ocorreu um problema ao criar um banco de dados de vector store: %@
ru: Возникла проблема при создании базы данных векторного хранилища: %@
zh_hans: 创建向量存储数据库时出现问题：%@

# MetalUnavailable.Annotations
source: annotations or URL shortcuts are open.
de: Anmerkungen oder URL-Verknüpfungen geöffnet sind.
ja: 注釈またはURLショートカットが開いているため。
pt_br: há anotações ou atalhos de URL abertos.
ru: открыты аннотации или ярлыки URL.
zh_hans: 有注释或 URL 快捷键处于打开状态。

# MetalUnavailable.Announcement
source: an announcement (yellow bar) is visible.
de: eine Ankündigung (gelber Balken) sichtbar ist.
ja: アナウンス(黄色いバー)が表示されているため。
pt_br: há um comunicado (barra amarela) visível.
ru: отображается объявление (жёлтая полоса).
zh_hans: 有通告（黄色横幅）可见。

# MetalUnavailable.ContextAllocationFailure
source: of a temporary failure to allocate a graphics context.
de: vorübergehend kein Grafikkontext zugewiesen werden konnte.
ja: グラフィックスコンテキストの割り当てに一時的に失敗したため。
pt_br: de uma falha temporária ao alocar um contexto gráfico.
ru: произошёл временный сбой при выделении графического контекста.
zh_hans: 临时分配图形上下文失败。
